cats_99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "name" = $2, "sex" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "Red"], ["name", "Ellie"], ["sex", "F"], ["updated_at", "2021-04-03 17:46:33.370548"], ["id", 1]]
---
    def update
        @cat = Cat.find(params[:id])
        if @cat.update_attributes(cat_params)

INSERT INTO "cats" ("birth_date", "color", "name", "description", "created_at", "updated_at", "sex") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save